// 展旭記錄資料庫
const records = {
  
  "1": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [],
    "24": [],
    "25": [],
    "26": [],
    "27": [],
    "28": [],
    "29": [],
    "30": [],
    "31": []
  },

  "2": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [],
    "24": [],
    "25": [],
    "26": [],
    "27": [],
    "28": [],
    "29": [] // 只會在閏年有效
  },

  "3": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [],
    "24": [],
    "25": [],
    "26": [],
    "27": [],
    "28": [],
    "29": [],
    "30": [],
    "31": []
  },

  "4": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [
      { type: "link", content: "https://photos.app.goo.gl/piYWLwCRQufqTx3B8", label: "2016年4月17日 搭公車前往謝師宴" }
    ],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [],
    "24": [],
    "25": [],
    "26": [],
    "27": [],
    "28": [],
    "29": [],
    "30": []
  },

  "5": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [],
    "24": [],
    "25": [],
    "26": [],
    "27": [],
    "28": [],
    "29": [],
    "30": [],
    "31": []
  },

  "6": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [],
    "24": [],
    "25": [],
    "26": [],
    "27": [],
    "28": [],
    "29": [],
    "30": []
  },

  "7": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [
      { type: "link", content: "https://photos.app.goo.gl/B9e7yFksC4vg4YaZ8", label: "2016年7月22日 \
        我好累 真的好累 可是我整整24小時睡不著了 一闔上眼記憶就撕裂著 痛得醒來 我不知道幾時會病倒 但是快了 甚至工作也無法讓我分心 \
        這個時間點 我的眼睛雪亮了 看得清清楚楚了 但我確不曉得是不是該相信記憶中你說過的話 我相信你不會騙人 我相信你記得初衷 就算我愚蠢著被騙也得相信 \
        過去未來 究竟哪個是真實的你 都是也都不是 不過沒有一個時空存在著永恆的我們 我們就是現在的我們 不要去相信歌詞裡的幻想 真切的力量存在你我彼此歷練之後的陪伴 \
        我請自己 真真切切的思考 我要的是什麼 決定是什麼 這個決定是我的 而決定之後誰也阻止不了我去履行 這是屬於我自己的事情 卻是為了過去而痛著 為著未來而奮力一搏 \
        死都不會如此痛苦 800多天的努力只要一句話就能否定我 獨角戲罷了沒有意義" }
    ],
    "23": [
      { type: "link", content: "https://photos.app.goo.gl/xr3WGedek85w98C27", label: "2016年7月23日 \
        種種的回憶 我以前原來是個廢到底的垃圾 原來你快樂 比世界上任何事重要 我卻像小孩 有時予取予求 有時無理取鬧 忽略了你好多感受 \
        修著以前長途旅行的照片 一點一滴回想著檢討著" }
    ],
    "24": [],
    "25": [],
    "26": [
      { type: "link", content: "https://photos.app.goo.gl/XpJ6R4QR2tKSc96A6", label: "2016年7月26日 \
        我還是原來的那個我嗎 我覺得我真的已經開始不認識自己了 也許這句話是某句臺詞 但現在沒有比這句話更適合描述自己 \
        我會好好思考我為何而活 活著對我的意義又是什麼 在茫然中 前進 思考 徹底反思 人生 意義 思考 反省" }
    ],
    "27": [],
    "28": [],
    "29": [],
    "30": [],
    "31": []
  },

  "8": {
    "1": [],
    "2": [
      { type: "link", content: "https://photos.app.goo.gl/JsSfHAdcxeAm76Hk7", label: "2016年8月2日 \
        腸胃內科 實習 第一天 嗯是一切好的開始呢 因為主治出國一個禮拜啦 \
        現在除了晨會等例行公事 實在是沒事啊 但某些原因 其實我並沒有特別開心 但是既然有機會 就把握時間看看書吧 走進好久沒來的圖書館 充滿著大學時的回憶 \
        二樓的討論室 翠華齋 一樓的單人座位 二樓左邊裡面的轉角座位等等 一幕一幕的回憶刷過腦海 雖然現在帶著酸苦的心情想起這些 但我相信會更好的 充實自己 讓自己比過去不一樣(過去應該直接蹓回去打電動了) \
        開工吧 期待回憶裡的場景 未來還能繼續出現在圖書館的某一角 firstchoice 回憶" }
    ],
    "3": [],
    "4": [
      //{ type: "text", content: "測試文字" },
      { type: "link", content: "https://photos.app.goo.gl/nsukrSJaPRh8LTmD8", label: "2016年8月4日 \
        世界上有種男人跟畜生一樣 把剛分手的女生吃死死 利用這點 滿足自己齷齪噁心的性需求 我告訴你 幹你老爸老母操機掰當初怎不把你射牆上 \
        我幹你全家 去死一死吧 最好不要讓我遇到你 以後你再敢動她 等著上社會新聞頭版 不過你應該也看不到了 操你爸媽是垃圾 沒把你教好 \
        家裡開中藥店 等著被砸店 畜生" },
      { type: "link", content: "https://photos.app.goo.gl/xTMABD1L8PYto82y7", label: "2016年8月4日 \
        希望這個開中藥店的畜生 這禮拜給我把你那隻爛鳥勒緊 我絕對會找到你 幹你娘 幹你十八代祖宗 我會先剁你手 不要懷疑" }
    ],
    "5": [
      { type: "link", content: "https://photos.app.goo.gl/Qh57F5GRnVFLMPFn6", label: "2016年8月5日 \
        過了這一晚 我發現 無論是誰 還是先疼自己最重要 擇我所愛 愛我所擇 一點都不容易 \
        這一關 我過得去嗎 可以 原諒滿腦精蟲的畜生 我做得到嗎 也許無法 如果兩年多前就知道會如此坎坷的話 我會做什麼選擇 \
        不能停下腳步 後悔沒用 先自愛" },
      { type: "link", content: "https://photos.app.goo.gl/pvZKiFYrvdBhbveZ6", label: "2016年8月5日 \
        我只是想認真當個好醫生 用心學習跟照顧病人 可是我真的累了 我好像連自己都照顧不了了 兩個多禮拜 我因為妳每天幾乎戰戰兢兢 撕心裂肺的過 度日如年 生不如死 \
        記得內科第一個月 因為太過忙碌跟直接毫無經驗的進入內科 那時候的確也是每日如戰場 壓力非常大 但那時候我不會有害怕的感覺 \
        只是現在我每天都很害怕 害怕永遠失去妳 害怕妳傻傻被騙 害怕我沒有能力幫助妳 害怕妳不知道我在幫助妳 害怕我只能眼睜睜看著妳離去 說實話 我已經崩潰了 也許我也生病了 我不想跟任何人講太多話 似乎把自己封閉起來 讓自己無止境的流淚跟崩潰才能獲得平靜 \
        妳不知道他對妳你造成多大的傷害 這是我更難過的地方 但是感謝妳願意想 願意告訴我妳錯了 可惜這個錯是我永遠的傷痕 一個超越我底線打破我原則的傷害 同時也是我曾經對妳的忽略與錯誤態度 要付出的龐大代價 \
        但我依然挺住腳步 繼續前進 謝謝妳給我信任 傷痕依舊 但是信任會跟著時間撫平情緒 \
        等我 我被擊垮了很多次但還是爬了起來 如果有什麼能證明真愛 我想那是極端的痛苦 值班 疲憊 支離破碎" }
    ],
    "6": [],
    "7": [],
    "8": [
      { type: "link", content: "https://photos.app.goo.gl/fTcSU97ZJp2H8Uyy8", label: "2016年8月8日 \
        好像全世界 只有我一個人還記得妳的真實面貌 還記得妳最真的笑容 好像就是今天這句話 \
        那你有夠大的肩膀與胸懷能讓我不用再心疼她嗎 可以 我決定全盤接受妳的價值觀 我決定即使被欺騙也不後悔 最後的真愛 我想將它燃燒殆盡 \
        妳曾說 希望有一天我不要受不了妳的脾氣 受不了妳的任性跟霸道 \
        既然妳用最狠的心來打擊我了 我決定用夠大的胸懷 全盤包容 把妳找回來 \
        愛 痛苦的值班 痛苦的日子 我還沒放棄" }
    ],
    "9": [],
    "10": [],
    "11": [
      { type: "link", content: "https://photos.app.goo.gl/uWJ4b3NosNxoTzxy6", label: "2025年8月11日 直行車佔用轉彎專用車道" },
      { type: "link", content: "https://photos.app.goo.gl/a1LrepZJREGDXndZ6", label: "2016年8月11日 \
        經過同學的告知 我想告訴所有之前在ig 看過我衝動po文的朋友 不用再私下猜跟謠傳了 我現在就說真相 \
        實際的狀況就是 分手後與前女友的談論過程中 我把自己對前女友的想法加已揣測 加上偏差主觀 並且衝動發文 事後冷靜發現 跟本天差地遠 任何文章所提事情只是當下情緒爆發的猜測 \
        本人已經跟當事人道歉 發文原因是因為從同學傳來 不得不正視 \
        當初的發文是我幼稚的舉動 我的個人行為也與前女友完全無關 如果還有任何問題 我都寫在這裡了 請不要再繼續私下做無謂且傷人的解釋 一人做事一人擔" }
    ],
    "12": [],
    "13": [],
    "14": [],
    "15": [
      { type: "link", content: "https://photos.app.goo.gl/cKcCD72FPVYUakZm8", label: "2016年8月15日 \
        每一張大卡小卡的收拾 都是從我身上割下一塊血淋淋的肉 因為有妳無悔的支持 才讓我有如今的成長 但我希望最後的成長 可以用來回饋妳對我的好 可以用來證明我夠資格給妳幸福 \
        只是我不知道 該用什麼方法去完成 該用什麼心態去面對 或者 我該直接撒手不管 放棄這一切嗎 這樣的處境很無力 真的很無力 我到底該怎麼做才好" },
      { type: "link", content: "https://photos.app.goo.gl/5gFB53sSVrwq5tpcA", label: "2016年8月15日 \
        究竟還要多久才能找到生命中的平靜 跌跌撞撞至今 好不容易才要抓穩了卻突然摔落 當我爬起來的時候 是否能再找回平靜的安心感 是否能再放鬆臉頰再次微笑 \
        sunset sky bluemoon" }
    ],
    "16": [],
    "17": [],
    "18": [],
    "19": [
      { type: "link", content: "https://photos.app.goo.gl/UMxiFyVWNVJrCtEH6", label: "2016年8月19日 \
        半夜一點開始 陸陸續續新病人開始入院 奇怪的是這時間我居然完全睡不著 精神奕奕 於是接完之後肚子餓得要命 買了宵夜 隨意的點了YouTube一首歌 默默寫下今天滿溢的情緒 \
        下班的時候跟卓豪學長打招呼 看他用著燦爛的笑容 告訴我不要因為很多毛事失去當醫生的熱情 我很羨慕他 即使在忙碌的住院醫生生活 也有自己的愛人當歸屬 \
        醫院走道上看到一位父親推著輪椅的兒子 兩個人緊靠著窗戶 熱絡的玩著Pokemon抓著怪 這個遊戲還是有帶來好處的 \
        32-13X的病人讓我早中晚都耗很多時間陪他去做治療 先是早上去RT定位出血點 中午去治療做止血 晚上值班還給我喘起來急推照CXR \
        令我印象深刻的是前天宣佈他胃癌合併肝轉移 是第四期時 離婚沒有家庭的他說了 唉怎麼不讓我這麼死了好了 他的家人大概只剩下兩個女兒 其中一個還是奧運選手不在身邊 不斷胃出血的他 失去求生意志 我也只能袖手旁觀 \
        晚上接到一個修冷氣被電擊的老伯 算是內科收過主訴最特別的 然後收到腎臟科 好吧 也許有機會發生橫紋肌溶解 謝謝妳 我會振作" }
    ],
    "20": [],
    "21": [
      { type: "link", content: "https://photos.app.goo.gl/vCc7GpHwso5W2aHcA", label: "2016年8月21日 \
        未來的每一天 都得自己走下去 只有變得更好 才有機會遇到更好 封閉過去的甜美與善良 拖著長長的血跡前進 希望能隨著時間 一點一點割下內心的軟弱 \
        下個月跟潘副院長 骨科的日子只有苦 苦的日子只有自己知道 也只有穩穩走 不要想太多才能好好學習半夜面對空蕩的醫院走廊 也只有當過實習醫師的人懂 努力與苦撐 永遠是一個人的事情 不要奢求誰能當你的避風港 \
        未來的我是怎麼樣的人 就會值得怎麼樣的妳 這段痛苦不堪 生不如死的日子我這輩子都不會忘記 我是怎麼走過來的 以後也會這樣走下去 midnight alone" }
    ],
    "22": [
      { type: "link", content: "https://photos.app.goo.gl/isto48x1XKz3AZgJA", label: "2016年8月22日 夜騎 台北 騎個夜台北" }
    ],
    "23": [
      { type: "link", content: "https://photos.app.goo.gl/RnybMSPhrLZAm4gLA", label: "2016年8月23日 \
        希望妳還記得我們曾經看過的一句話 我知道人總有取捨 你取了你覺得重要的東西 捨棄了我 這只是你的選擇而已 \
        這只是妳的選擇而已 因此我接受 妳可以任性的 要的時候要 不要的時候不要 時間會告訴妳我 失去了什麼 又得到了什麼 什麼該後悔 什麼該保握 \
        但錯過了 就可能會永遠錯過 只是會有一個人需要帶著傷痛走下去 好久不見 謝謝妳 我會好好的 也不再想為什麼 加油" }
    ],
    "24": [],
    "25": [
      { type: "link", content: "https://photos.app.goo.gl/ke5QpEDaejFfe4cZ6", label: "2016年8月25日 \
        小練重訓第30天不間斷 成效不到自己預訂的目標 再接再厲了 記得某天在宿舍樓梯間做伏地 一個男生默默站在我後面看了許久 聊天後原來是三總護理師 \
        之後只要他看到我在做都會駐足然後給我打氣 昨天還受到他的加油鼓勵 這種感覺有點奇怪 不過幸好不是吵到他就好 Keep going on" }
    ],
    "26": [
      { type: "link", content: "https://photos.app.goo.gl/yyfAeHB5BpyXM8sbA", label: "2016年8月26日 \
        其實所謂在一起 並不是互相依靠 互相依賴 如此久了會喪失照顧好自己的能力 當然也照顧不了別人 \
        慢慢的要走過難熬的傷痛 然後感謝妳這個決定讓我懂 無論任何一種感情存在 要依靠的一直是自己 \
        當我不再是別人壓力的時候 就能成為彼此前進的助力 當我不再是別人負擔的時候 就能為彼此生命共同承擔 \
        感情與工作都是如此 看透了黑暗面 也要收起玻璃心 生命會為自己找到出路 環境再坎坷 也不能失去自己的積極與誠心" }
    ],
    "27": [
      { type: "link", content: "https://photos.app.goo.gl/Dien47o2pDWhSRaf9", label: "2025年8月27日 不緊靠道路右側停車" }
    ],
    "28": [
      { type: "link", content: "https://photos.app.goo.gl/f1rwDgUAbNhcK2P36", label: "2016年8月28日 今晚喝酒其它都不要想了" }
    ],
    "29": [],
    "30": [
      { type: "link", content: "https://photos.app.goo.gl/8rFBUsxYktoPxxY26", label: "2016年8月30日 \
        兩三個禮拜以來漸漸調適情緒 以為即使痛苦也不會再痛哭 可惜晚上收到小生的來信 又點了他專頁的文章 \
        然後影片開頭的20秒我便爆哭了 非常悽慘的爆 倒不是因為劇情 而是想到了自己 第40天,每天我都追得很辛苦 然而今天當面看到她的冰冷 我發現自己無法招架了 每一次釋出善意 都變成身上多了一條傷痕 \
        我好像魯夫 在被敵人摧殘了數次之後 依然頑固的拖著滿身血爬起來 可惜不同的是 我真的輸了 \
        事實上我一直沒有告訴妳 也因為妳的臭臉讓我無法講出來 每一次找你見面 我只是想看到妳的笑容而已 就是這麼單純 所以沒有什麼特別目的 可惜我沒有成功 妳也從來不知道為何我想見面 \
        我不懂明明繼續走下去會越來越好 會越來越扎實 為何妳選擇停下了 但不管如何 我不能因此失去自己 我要用屬於自己的生活方式 慢慢好起來 我可以打敗仗 但不能不繼續打仗 \
        這是我最後一次發感情文了 真的很可悲 因為這些鳥事哭掉20年份累積的眼淚 再見了真的 再見了機巴痛苦的回憶 幹機掰我孬" }
    ],
    "31": []
  },

  "9": {
    "1": [],
    "2": [],
    "3": [
      { type: "link", content: "https://photos.app.goo.gl/CsEoQXBreZHa1PWx8", label: "2016年9月3日 九三軍人節 可惜今天是刀一 整天穿著外科手術衣沒有機會穿軍服 所以到底要開刀的日本人什麼時候來啊 為了你我還沒吃晚餐啊啊" }
    ],
    "4": [
      { type: "link", content: "https://photos.app.goo.gl/pGJBb3UkARgaXhhr7", label: "2016年9月4日 \
        自己的私人時間假的 超過十分鐘的吃飯時間假的 充足的睡覺時間假的 下班的時候有人當靠山假的 只有桌上簡單的便當跟每天超過幾十小時的手術是真的 \
        吃完交班總醫師請的最後的晚餐 就要做好下地獄的決心 OK這樣的生活也不賴 每天聞著血味跟各種挖骨怪機械的聲音" }
    ],
    "5": [],
    "6": [],
    "7": [],
    "8": [
      { type: "link", content: "https://photos.app.goo.gl/jL2coUwBwDhsNX4j6", label: "2016年9月8日 \
        每天看不見終點的刀房日子 身心都非常疲倦了 我開始懷疑自己適不適合當醫生 其實我並不是很想 只是選擇了沒有退路 只有讓自己愛自己所擇 要撐住 不能放手努力過的歲月 \
        旅途終究還是一個人上路 想念自己的日子 想念只把風景留給自己的日子 想旅行了" }
    ],
    "9": [],
    "10": [],
    "11": [
      { type: "link", content: "https://photos.app.goo.gl/GS4ha6NgSMNT6iru6", label: "2016年9月11日 \
        今天再來隆重介紹一下刀房雞腿便當 沒錯今天刀一 從早上八點到現在總計20幾分鐘的吃飯時間 其他都是上刀上刀上刀刀刀刀 吃完還有三台刀準備戰到晚上十點 \
        老弟 5-10分鐘吃便當可以嗎 等下沒有人幫我抬腳 我實在很懷疑學長今天有沒有吃飯 今天心情跟外面的天氣一樣鬱卒 幸好還有學長請的草莓歐蕾跟進步的便當菜色 \
        最後我只告訴自己 這就是人生啦 開好開滿 不休息" }
    ],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [
      { type: "link", content: "https://photos.app.goo.gl/SfojkzAHUcevTpNP9", label: "2016年9月20日 \
        帶著一些讀物跟簡單的晚餐 連假輕易的結束了 鬱悶的是帶許多想解決的疑惑回鄉 直到現在卻仍沒有答案 把內心的結帶來帶去 似乎是壓力的源頭 幸好寶可夢轉移了注意力 幸好同學朋友們依舊開心 回鄉還是最好的療癒 \
        景物依舊 而過幾年以後我又會如何看待 那麼等著時間走過再慢慢體會 大概是最消極也是唯一的辦法了 \
        地獄的骨科還有兩個禮拜 要堅強 要撐住" }
    ],
    "21": [
      { type: "link", content: "https://photos.app.goo.gl/WFTsJ35TY95XPyuj8", label: "2025年9月21日 跟Barry比心電圖目前大輸五分追得上嗎" },
      { type: "link", content: "https://photos.app.goo.gl/zHXyt9AkmptewenHA", label: "2025年9月21日 ECG進階課程真的太精彩實用 專家就是把細節看到骨子裏" },
      { type: "link", content: "https://photos.app.goo.gl/UQQuKCYz8T52F1yAA", label: "2025年9月21日 週末一早被鞭策來上課" },
      { type: "link", content: "https://photos.app.goo.gl/vvYCMRC4UVUGBxXw5", label: "2025年9月21日 他兒子超有天份欸" },
      { type: "link", content: "https://photos.app.goo.gl/qTvvtCzhjgCJ1DmaA", label: "2024年9月21日 芒果軟糖 超級愛吃 希望以後能再回越南" },
      { type: "link", content: "https://photos.app.goo.gl/AG6j6LgVZLYYmAnL7", label: "2023年9月21日 想當年入伍訓是在地上爬旁邊引爆炸彈" },
      { type: "link", content: "https://photos.app.goo.gl/AWqoRNuSJ9M6akqp6", label: "2022年9月21日 I don't like to much ketone in my body" },
      { type: "link", content: "https://photos.app.goo.gl/25KjWZ5rkbgYrLh78", label: "2021年9月21日 大推的腳架清理&修理" },
      { type: "link", content: "https://photos.app.goo.gl/dHMdgjZiP4qwx34n7", label: "2020年9月21日 內心都有天使與惡魔交戰 不爭氣的用自己睡覺時間認命開" }
    ],
    "22": [
      { type: "link", content: "https://photos.app.goo.gl/q2C6sRfdTb9M1dA69", label: "2025年9月22日 雖然發美食的頻率會下降 但有信心推薦的店家是絕對好吃的 也會慢慢轉換到THREAD上經營囉" },
      { type: "link", content: "https://photos.app.goo.gl/Kk8mmQ3yc7vGvRQQ9", label: "2025年9月22日 亞洲社會從小就是學習一個錯誤的工作態度 大家都甘願鞠躬盡瘁 卻從來很少對自己人生的快樂跟健康負責" },
      { type: "link", content: "https://photos.app.goo.gl/L2Ry2nhqmbAcwozJ6", label: "2025年9月22日 去歐美洲千萬不要帶電腦" },
      { type: "link", content: "https://photos.app.goo.gl/tAeiRPdfhosRvSy89", label: "2025年9月22日 從此不再對始祖鳥有信仰了" },
      { type: "link", content: "https://photos.app.goo.gl/CDLez9fYNtVY3g7c9", label: "2025年9月22日 政府會操弄輿論欺騙人民 大力提倡醫護應該要發展自媒體 應該要有自己的音量" },
      { type: "link", content: "https://photos.app.goo.gl/MwjDYDArLtdLU4XW8", label: "2025年9月22日 我也要當小狗" },
      { type: "link", content: "https://photos.app.goo.gl/hbRCsqz66M3nC2ed6", label: "2025年9月22日 以後我都會記得幫你按" },
      { type: "link", content: "https://photos.app.goo.gl/DhDkFTv8pdhVSgXn9", label: "2024年9月22日 對國家沒貢獻的嘴砲對國家有貢獻的人" },
      { type: "link", content: "https://photos.app.goo.gl/pnZ4NQ2HgVSoaTBN6", label: "2024年9月22日 健身完就是直接約永豆" },
      { type: "link", content: "https://photos.app.goo.gl/ERN5qLZmFcvpoTAZA", label: "2023年9月22日 南京復興站真的很愛你 一定要趁被拆下來之前趕快去合照" },
      { type: "link", content: "https://photos.app.goo.gl/TowJEBhtvFCuQqXu9", label: "2023年9月22日 下午小補眠一下還是全身無力 要檢查每週一跑真的很困難" },
      { type: "link", content: "https://photos.app.goo.gl/gwhDj5wU8wXW4eBr9", label: "2022年9月22日 氣切管的氣囊壓力" },
      { type: "link", content: "https://photos.app.goo.gl/bQsAft4LoTbGVF4L7", label: "2019年9月22日 離開營區就像入獄後能短暫假釋 繼續逆著大浪 慢慢成長茁壯" },
      { type: "link", content: "https://photos.app.goo.gl/aAR699nw4GVuKCb79", label: "2017年9月22日 這才是生活 但是它很短暫 此生發誓及早退休" },
      { type: "link", content: "https://photos.app.goo.gl/uDAT7pPpgyNfTvZi9", label: "2016年9月22日 連續完全沒坐下上刀九個小時解鎖 站到自己講話胡言亂語 飯菜都又冷又硬 不過好充實啊 又刷新自己的耐力記錄了 晚點繼續加油 nolimit" }
    ],
    "23": [
      { type: "link", content: "https://photos.app.goo.gl/P4qdMdUaJKsdgAEU7", label: "2025年9月23日 怎麼可能站立死亡" },
      { type: "link", content: "https://photos.app.goo.gl/XpU8waBufmPZZvnU7", label: "2025年9月23日 社會住宅 我覺得要申請試試" },
      { type: "link", content: "https://photos.app.goo.gl/8sNWTUWarnhtyFZM9", label: "2024年9月23日 都2024年了怎麼還可以這麼無知" },
      { type: "link", content: "https://photos.app.goo.gl/SdgMbeLLv4sL7EHN9", label: "2024年9月23日 請問這是蓄意殺人嗎 沒關係你繼續害人" },
      { type: "link", content: "https://photos.app.goo.gl/WUX9cTHLbzr9g7RV7", label: "2023年9月23日 多希望我的工作能給我預一個十天長假 去拍這些世界美景才是人生" },
      { type: "link", content: "https://photos.app.goo.gl/tDxE2Rb3Wj7vE9mm8", label: "2023年9月23日 第一眼以為我是垃圾 每個月都需要啃肉 拼命的把鍋子塞滿好吃的牛肉 死不吃菜" },
      { type: "link", content: "https://photos.app.goo.gl/Wjd3pUYP4dchJpDz9", label: "2023年9月23日 rasitol作用機轉 網路資料有許多複雜但都不甚完美的說明及圖片" },
      { type: "link", content: "https://photos.app.goo.gl/1bVqXQjMEKVpduG59", label: "2019年9月23日 發售2022風景系列桌曆 賣場是在蝦皮一本250元" }
    ],
    "24": [
      { type: "link", content: "https://photos.app.goo.gl/2wrBJeYUoDBizjVP7", label: "2025年9月24日 這種壁虎可以養嗎" },
      { type: "link", content: "https://photos.app.goo.gl/wyQEiPYxXxLs5BBn6", label: "2025年9月24日 買買買 超好買" },
      { type: "link", content: "https://photos.app.goo.gl/9KhR47SkHLr6XQSYA", label: "2025年9月24日 AI太強了" },
      { type: "link", content: "https://photos.app.goo.gl/Lr7UmGhDLsNXqsct9", label: "2025年9月24日 健身工廠 花蓮也要開" },
      { type: "link", content: "https://photos.app.goo.gl/BeQ3XvKNJBnGQ71K6", label: "2025年9月24日 跟沒值班還留在醫院的悲苦人買漢堡王就算了 他還被店員多薛8塊錢" },
      { type: "link", content: "https://photos.app.goo.gl/M38BrwJc1vc6ndC39", label: "2025年9月24日 真的是醫院又窮又小又機掰" },
      { type: "link", content: "https://photos.app.goo.gl/xovbG5E8QyeUzjyu8", label: "2025年9月24日 花蓮有夠可怕" },
      { type: "link", content: "https://photos.app.goo.gl/gLxbhK1eGM7LqSdH6", label: "2025年9月24日 原來如此 太聰明了哈哈哈" },
      { type: "link", content: "https://photos.app.goo.gl/4vTmDiq1WsnYsvY66", label: "2025年9月24日 這個才是真的已讀亂回" },
      { type: "link", content: "https://photos.app.goo.gl/9RXZsS2FFYDpe6nD7", label: "2025年9月24日 居然有雨衣欸 這麼可愛哈哈哈" },
      { type: "link", content: "https://photos.app.goo.gl/Eq6USqzVn7kZDR9C7", label: "2025年9月24日 這是因為男生希望能跟女生聊久一點故意裝傻的" },
      { type: "link", content: "https://photos.app.goo.gl/ZALSTFK4dQznFZXB9", label: "2025年9月24日 他是不是以為不給他水了哈哈哈" },
      { type: "link", content: "https://photos.app.goo.gl/oX2vEu3JizgTn1QV8", label: "2024年9月24日 所以醫師開藥要對你負責 但這份責任要算免費？" },
      { type: "link", content: "https://photos.app.goo.gl/C7PBjc1zj1eeTgrWA", label: "2024年9月24日 我打到戰場傳說還是一堆不會看小地圖來幫忙的白痴隊友 這種只能說好人平安 但輸了應該畢竟隊友還在耍憨清中線吃兵" },
      { type: "link", content: "https://photos.app.goo.gl/WMGwfwckbQoYGhGK6", label: "2024年9月24日 這三句話要好好應用在職場" },
      { type: "link", content: "https://photos.app.goo.gl/jXsJsGCDAwpnjdAb8", label: "2024年9月24日 就診以前一定要先查醫師經歷 沒有專科的多半是受訓階段有問題 沒辦法通過受訓或是不吃苦選擇提早享受 這樣的人是不會認真幫你看病的" },
      { type: "link", content: "https://photos.app.goo.gl/5eLy9RSn1nZ3fYkK8", label: "2023年9月24日 氣切ballon破掉 很簡當的現象其實看過一次就會有印象 會持續放上這類臨床觀察的文章" },
      { type: "link", content: "https://photos.app.goo.gl/dzUWpQzKiihmdWA28", label: "2023年9月24日 破紀錄 第一次有這麼多筆簽章" },
      { type: "link", content: "https://photos.app.goo.gl/1Z8mLNApFWkjQbkJA", label: "2022年9月24日 感覺當時走進現場就會醉了" },
      { type: "link", content: "https://photos.app.goo.gl/EnMsbbBLTumdT7eS6", label: "2021年9月24日 2022風景系列桌曆 一本250元有興趣可以支持支持 小弟我不會收益任何一塊錢 最後收入也會撥一些捐給流浪狗之家" },
      { type: "link", content: "https://photos.app.goo.gl/9NDwjuCPS8j7zYLz7", label: "2018年9月24日 原來現實與制度是把利刃 確實地消磨著我 夢想不過是曾掛在嘴邊的無聊名詞" },
      { type: "link", content: "https://photos.app.goo.gl/zQf97S9D5Jnma3haA", label: "2018年9月24日 在海上努力用四個孤獨晚上 用針線縫出一隻White guy布偶 言出必行的女子不能亂惹" },
      { type: "link", content: "https://photos.app.goo.gl/GXeyStHhb6A53DzE6", label: "2018年9月24日 顛簸的航程 像邊地震邊試著睡著 超級狹窄的小床 有人肚子很痛很緊急趕快來看 恩沒睡" },
      { type: "link", content: "https://photos.app.goo.gl/3M9qjTVgHemp6SmEA", label: "2017年9月24日 我麻吉 跟朋友一起吃飯囉 沒朋友" }
    ],
    "25": [
      { type: "link", content: "https://photos.app.goo.gl/URMWfeRgvjSTJmkQ6", label: "2024年9月25日 這樣有回答到嗎 有啊" },
      { type: "link", content: "https://photos.app.goo.gl/UXftAjtfwhkR6rpz5", label: "2023年9月25日 喬神都會爆了 何況凡人" },
      { type: "link", content: "https://photos.app.goo.gl/6T5uMh5pqsKTmWeR7", label: "2023年9月25日 英雄所見略同 DK大神這次跑的攝影行程 剛好就是我原本心中完美的北越風景行程 好想放下一切去拍照" },
      { type: "link", content: "https://photos.app.goo.gl/uJPF6aHJwya8Uahv7", label: "2022年9月25日 太扯了吧 居然戴迪卡儂手錶" },
      { type: "link", content: "https://photos.app.goo.gl/Lpy2TUjTaVZZN3YK8", label: "2022年9月25日 四獎 中了4000元 95張發票 哇靠" },
      { type: "link", content: "https://photos.app.goo.gl/9WB1qBeRot3FXNvB7", label: "2021年9月25日 追焦功力超強的 台灣風景一哥追蹤起來" },
      { type: "link", content: "https://photos.app.goo.gl/PxvZ8eESp8Li5qsr8", label: "2017年9月25日 開始還病歷債囉" }
    ],
    "26": [
      { type: "link", content: "https://photos.app.goo.gl/xmQSEsqdK7mcpRUF7", label: "2024年9月26日 \
        台北韓丰117 目前最滿意的韓式料理之一  我們點兩人套餐 肉品是半半炸雞 沒有擾人的筋跟皮 炸的非常酥脆 肉質也鮮美多汁 \
        海鮮煎餅偏向濕軟 這是我唯一比較沒那麼喜歡的地方 我個人喜歡脆脆的外皮 但還是味道又香 口感也算紮實 \
        燒烤牛肉片超級喜歡 份量也剛好超級好吃 最後甜點是脆皮雪糕 感覺很像是韓國的小甜品 很好吃但覺得太少了 \
        整體而言價格不貴 但基本上都很滿意 是一個韓式小品的餐點" },
      { type: "link", content: "https://photos.app.goo.gl/iZxjimGbBMHYMGNX6", label: "2024年9月26日 這不能走路 只能抱著" },
      { type: "link", content: "https://photos.app.goo.gl/P8Wi1zfpk2EwUqnt9", label: "2024年9月26日 夏天當然是養鴨子 冬天鴨子凍死就能吃薑母鴨囉" },
      { type: "link", content: "https://photos.app.goo.gl/fh8XwLy44K6A1SGp7", label: "2024年9月26日 那手臂加強大師是沒被電過吧" },
      { type: "link", content: "https://photos.app.goo.gl/iq4f57MUeA8aTD9u5", label: "2024年9月26日 正確方式是要把媽媽支開來再問" },
      { type: "link", content: "https://photos.app.goo.gl/N6U3cSDP1GLzewPz9", label: "2024年9月26日 \
        粉專成立&內專考試心得 考過內專後才讓粉專實至名歸 但面對內科我仍是無知的 \
        考試前幾個月 apen app上有些匿名故意攻擊我的 這些惡意的謠言我並不急於回覆 但藉此契機分享為何有這個粉專 \
        我在醫學院畢業的成績不好 是後段班 醫師國考雖一次過 但也幾乎憑感覺猜完答案 於選擇了內科 我意識到自己根本沒辦法處理臨床任何問題 就連補鉀降鉀都不會 當時感覺溺斃在內科這片深海裡了 \
        因此成立這個粉專 一方面是幫助自己記憶遇到的case 一方面是希望跟我一樣 資質不好又找不到幫助的人 可以得到救贖 可以在面對困惑時找到答案 更可以想到pgy從0開始努力補救的我都能有機會長大 那你也一定沒問題 千萬不要放棄 \
        希望跟我一樣在內科大海裡迷茫的人 知道我也是其中之一 非常辛苦痛苦但仍努力存活著 一起加油" },
      { type: "link", content: "https://photos.app.goo.gl/uu1VeUtZ3KRa8C1i7", label: "2023年9月26日 \
        原來今天實習醫生座談會這麼精彩 應該也不少人跟我一樣 一直生活在相對權威的環境 \
        從小家庭就是相對權威 很小的時候因為調皮被威脅要送我進軍中(沒想到後來真的進去) 幾乎沒有跟同學出遠門旅遊看電影等 也無法自然的跟朋友相處 社交能力非常差 最快樂的時候只有國中瘋練籃球的時光 \
        因為家庭的封閉教育 我不知道如何表達自己的不滿 我不知道如何拒絕別人 我不知道如何與人協商 任何事情我只能被動的接受 如果不喜歡就忍耐 所以看似很乖很愛讀書 實則讓後來的自己吃很多很多虧 \
        高中相對校園更開放 我反倒很不習慣 極度無法適應把自己封閉 堅持著拒絕社交 每天讀書跟補習的生活 很羞愧的是當初覺得同學都不務正業 但畢業後才發現不正常的是自己 \
        當時我很有病的穿南一中的制服上學 因為父母告訴我只能讀一中但我卻差了一分 我國中班排第四 前十名都考上第一志願唯獨沒有我 而這個舉動讓我覺得很優越 跟同學分別 但如今卻覺得可笑 自欺欺人 \
        我現在非常感謝當初是讀南科實中 老師包容我上課不聽課的個性 讓我因為成績好就享受很多資源(例如去參加NASA視訊 模擬聯合國會議) 只是我當時不懂這些資源的好 幸好部分高中同學雖然當我異類 卻很願意跟我做朋友 \
        很不幸大學又被家裡叫去讀軍校 因為衝著認為醫科很耀眼的頭銜而去 卻沒有想過「軍費」背後代表的意義 於是我再次承受高壓的環境 更封閉自己 但也因為同學來自各地 漸漸學會一點正常的社交跟看氣氛 \
        從來沒有任何長官告訴我可以離開 當有不適應時 一定先檢討你一番 最後輔導你 描繪繁華不實的未來藍圖  摸頭留下 過不久你再次因現實而破滅幻想 \
        高中自以為很會讀書 來到大學才知道什麼是真正的聰明跟善用資源 過去封閉的家庭生活 我沒有跟人接觸 永遠只會土法煉鋼 不知舉一反三跟找資料 後來成績都墊底 一路爬到今天 同學都在飛 而我還在爬 \
        這幾年我才意識到自己 認識真正的自己 我也才決定了人生的目標跟生活態度 雖父母口口聲聲說他們比我更了解我 但越聽越覺得錯的離譜 我是極度崇尚自由的 不需有任何人「帶壞我」 我無法接受必須按照誰的標準或準則生活 若真要說我應該走藝術相關比較適合 \
        一路上不停的忍耐 後來又轉變成不停的碰撞 然後現在變成靜觀其變 只求穩定中求生存的個性 對於權威體制 我依然是非常排斥 但似乎沒有想辦法把自己過好以外 更好的辦法了 \
        一間醫院能有這麼多因為環境壓抑自殺的案例 實在很難想像我能心態越來越堅強 \
        權威是多麼可怕的事情 他能剝奪很多人思考的能力 剝奪他們原本應該有的創意跟發展 小則茶毒小孩跟學生 大則掌權茶毒國家官商勾結 然後壓榨基層甚至剝奪人命 \
        希望我們這一代的 都能好好改變環境 讓環境變得更宜人 不再把不合適的價值觀強加在別人身上了" },
      { type: "link", content: "https://photos.app.goo.gl/HwgjZhVT6DsDsDxV7", label: "2021年9月26日 日歷我是第一個買兩本 支持一下" },
      { type: "link", content: "https://photos.app.goo.gl/mx8wYwSgYKtN49pY7", label: "2020年9月26日 用20分鐘跑五公里是滿有效率的運動 能有20分鐘能忘記世俗煩惱" },
      { type: "link", content: "https://photos.app.goo.gl/qEy1rDhDVJqsEUcE6", label: "2020年9月26日 出售Nikkor 上班忙碌買來沒時間用 公司貨購入後遺失保卡但盒子與其他配件均在 可7-11先付款後寄送 寄送不負損壞責任但寄出前均會拍完整包裝與鏡頭狀況" },
      { type: "link", content: "https://photos.app.goo.gl/JmNGaybbNnUX1yQv9", label: "2018年9月26日 所謂的伙房就是蟑螂養殖場 還沒看過好幾個蟑螂屋在五個小時內全客滿的 黑壓壓的一片觸鬚" },
      { type: "link", content: "https://photos.app.goo.gl/fLjBjHm1KjkfsQY38", label: "2017年9月26日 早上要報Journal 下午要上課評鑑 Suffer" }
    ],
    "27": [],
    "28": [
      { type: "link", content: "https://photos.app.goo.gl/ff3PwqwbXewHkvT36", label: "2016年9月28日 \
        倒數一天骨科下刀 跟骨科相比內科真的輕鬆很多 但這四個月真的好難熬 不過並不後悔選了骨科 也不後悔跟著潘副院長 完全是體力與腦力的鐵人接力賽 從肩膀手肘髖關節膝關節踝關節到阿基里斯腱 全身上到下一個不漏 \
        我個性向來粗心 而潘副卻是細心到魔鬼的細節裡 這個月是個大洗禮 無論是見識關節鏡的奧義或是副座做人的道理 壓力逼自己一定得長大 \
        也感謝廷逸學長超級的包容力跟火力掩護 才能一路撐到月底 \
        最後兩天颱風假我都安全的躲在醫院 昨天還連躲手術房12小時 果然有沒颱風都干我屁事啊" }
    ],
    "29": [],
    "30": []
  },

  "10": {
    "1": [],
    "2": [],
    "3": [],
    "4": [
      { type: "link", content: "https://photos.app.goo.gl/orXuqGymccZpTAbz9", label: "2016年10月4日 \
        終於體會到 真正絕望到全身無力的感覺 手不斷得發抖 是真的身平以來 當下想就這麼趴倒 被一槍打死都沒這麼難受 \
        無論命運再怎麼蹂躏我 讓我辛苦讓我失敗甚至詆毀我 我都不怕 可是絕望會 很深很深的絕望 \
        要讓一個人死不需要複雜的算計 讓他連一點希望都沒有就好" },
      { type: "link", content: "https://photos.app.goo.gl/6ibQwhcHUvWsz36K8", label: "2016年10月4日 \
        血液腫瘤科 小成就 一個月 \
        來這裡一個月 還是想特別記錄一下無聊中的小小喜悅 那就是port-A(人工血管通路)的實行了 \
        一開始我連備物都不知道 完全不知道以前OSCE是怎麼通過的 然後大概做兩次之後好像不自覺的開始上手 漸漸越來越順 \
        第三禮拜我嘗試用英文給烏克蘭交換生示範port-A的施行 發現好像緊張中也能安全完成操作 \
        然後中間也幫同學cover兩床難放的port-A (什麼是難放 簡單說就是人工血管的基座埋在皮下太深 或者病人不太瘦皮脂厚 就很難定位) \
        剛好今天交班前又一床難放的 病人表示從前護理師或intern都要放三次以上或用長針 當下聽到心理躍躍欲試想挑戰 冷靜準備之後 沒想到一針短針直接到位 被小小稱讚 \
        不過最重要的是 施行同時顧病人疼痛感受 盡量快狠準的完成 待了一個月了也許自己沒什麼長進 但是on port-A的感覺 離開後還是會永遠記得 \
        0敗 繼續維持" }
    ],
    "5": [],
    "6": [],
    "7": [
      { type: "link", content: "https://photos.app.goo.gl/UjcfVeLsSqnrc54Y8", label: "2016年10月7日 \
        朋友家人都瞭解妳的個性 但只有我夠白目 總是在知道事情以後對妳耳提面命 要妳保護自己 要妳多想想 要妳會看人 換來的是我不包容妳不懂妳 \
        我是很多嘴 妳以為我不理解妳 但妳難道就理解外面的人的想法嗎 \
        有些經驗發生在自己身上就已經太遲了 我已經盡力了 每天為妳提心吊膽而不被領情 真的好累好無力 什麼都做了卻挽回不了 我幫不了妳什麼 這樣下去真的只是彼此的困擾 \
        也罷 這樣的結果我也有責任 是我不夠好 \
        最後給了尊重跟包容 也只能祝福妳 謝謝妳教會了我許多事情 收拾完了 一切都重頭開始吧 \
        無力 放棄 theend" }
    ],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [
      { type: "link", content: "https://photos.app.goo.gl/siqb6ZkRGnLH9K4eA", label: "2016年10月17日 xmen fundus Ophthalmoscope 眼科intern最終型態" }
    ],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [],
    "24": [],
    "25": [],
    "26": [],
    "27": [],
    "28": [],
    "29": [],
    "30": [],
    "31": [
      { type: "link", content: "https://photos.app.goo.gl/3NDUudjQUo5zTVRd8", label: "2016年10月31日 高雄榮民總醫院 終於能當身心靈健康快樂der英藤惹" }
    ]
  },

  "11": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [
      { type: "link", content: "https://photos.app.goo.gl/AsJJ5kjzacQxw8QKA", label: "2016年11月8日 徵外拍模特兒 清新健康 攝影本是快樂事 車馬費詳談 可長期 文藻外語大學 西三C教室" }
    ],
    "9": [],
    "10": [
      { type: "link", content: "https://photos.app.goo.gl/ibUnW7vfoxCCS8pH8", label: "2016年11月10日 屏東東港東隆宮 返回陽間的感覺真好 可是已經過一半ㄌ" }
    ],
    "11": [
      { type: "link", content: "https://photos.app.goo.gl/5uxQhntJZdxREUah7", label: "2016年11月11日 夠綠了還抽綠菸 沒事兒沒事兒 這跟抽完就要戒了 戒菸門診 抽煙 慎思" }
    ],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [
      { type: "link", content: "https://photos.app.goo.gl/jbCkD6HoxzGd7iRE6", label: "2016年11月23日 來幫學長測試第一台VHIT 暈眩門診 VHIT VIN 眼震測試" }
    ],
    "24": [],
    "25": [
      { type: "link", content: "https://photos.app.goo.gl/FbXzz68BwBD4WZt3A", label: "2016年11月25日 CILF 幹伶娘你們是在嗆三小 找死是不是 沒有很可以 但你惹不起" }
    ],
    "26": [],
    "27": [],
    "28": [],
    "29": [],
    "30": [
      { type: "link", content: "https://photos.app.goo.gl/yAsywEugFXvjtrNN7", label: "2016年11月30日 高雄一個月尾聲到了 在這裡發生了很多事情 知足常在 高雄榮總 尾聲" }
    ]
  },

  "12": {
    "1": [],
    "2": [],
    "3": [],
    "4": [],
    "5": [],
    "6": [],
    "7": [],
    "8": [],
    "9": [],
    "10": [],
    "11": [],
    "12": [],
    "13": [],
    "14": [],
    "15": [],
    "16": [],
    "17": [],
    "18": [],
    "19": [],
    "20": [],
    "21": [],
    "22": [],
    "23": [],
    "24": [],
    "25": [],
    "26": [],
    "27": [],
    "28": [],
    "29": [],
    "30": [],
    "31": []
  }

};
